pokemonDb/app/controllers/pokemon_controller.rb

  def index
    @pokemon = Pokemon.all.shuffle()
---
SELECT "pokemons".* FROM "pokemons"